iNavFlight/inav/src/main/target/stm32h7a3_impl.c
uint8_t _checksum(uint8_t current, uint8_t newData)
{
	return current ^ newData;
}

uint8_t readAllFlash(void)
{
	uint8_t check = 0;
    /*
    const uint8_t *p = &__config_start;
    const configHeader_t *header = (const configHeader_t *)p;

    if (header->format != EEPROM_CONF_VERSION) {
        return false;
    }
    uint16_t crc = crc16_ccitt_update(0, header, sizeof(*header));
    p += sizeof(*header);

    for (;;) {
        const configRecord_t *record = (const configRecord_t *)p;

        if (record->size == 0) {
            // Found the end.  Stop scanning.
            break;
        }

        if (p + sizeof(*record) >= &__config_end) {
            // Too big. Further checking for size doesn't make sense
            return false;
        }

        if (p + record->size >= &__config_end || record->size < sizeof(*record)) {
            // Too big or too small.
            return false;
        }

        crc = crc16_ccitt_update(crc, p, record->size);

        p += record->size;
    }

    const configFooter_t *footer = (const configFooter_t *)p;
    crc = crc16_ccitt_update(crc, footer, sizeof(*footer));
    p += sizeof(*footer);
    const uint16_t checkSum = *(uint16_t *)p;
    p += sizeof(checkSum);
    eepromConfigSize = p - &__config_start;
    return crc == checkSum;

    */

	for(uint8_t *p = FLASH_TEST_START_ADDRESS; p < FLASH_TEST_END_ADDRESS; p++){
		check  = _checksum(check, *p);
	}

	return check;
}

// clock bits removed fomr hal_msp file
void stm32h7a3_rcc_clock_config(void)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

    // SYSTEM
    __HAL_RCC_SYSCFG_CLK_ENABLE();

    // CRC
#ifdef HAL_CRC_MODULE_ENABLED
    __HAL_RCC_CRC_CLK_ENABLE();
#endif



    // I2C
#ifdef USE_I2C
#ifdef USE_I2C_DEVICE_1
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_I2C1;
#endif
#ifdef USE_I2C_DEVICE_2
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_I2C2;
#endif
#ifdef USE_I2C_DEVICE_3
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_I2C3;
#endif
#ifdef USE_I2C_DEVICE_4
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_I2C4;
#endif
#ifdef USE_I2C_DEVICE_5
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_I2C5;
#endif

    PeriphClkInitStruct.I2c123ClockSelection = RCC_I2C1235CLKSOURCE_D2PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

#ifdef USE_I2C_DEVICE_1
    __HAL_RCC_I2C1_CLK_ENABLE();
#endif
#ifdef USE_I2C_DEVICE_2
    __HAL_RCC_I2C2_CLK_ENABLE();
#endif
#ifdef USE_I2C_DEVICE_3
    __HAL_RCC_I2C3_CLK_ENABLE();
#endif
#ifdef USE_I2C_DEVICE_4
    __HAL_RCC_I2C4_CLK_ENABLE();
#endif
#ifdef USE_I2C_DEVICE_5
    __HAL_RCC_I2C5_CLK_ENABLE();
#endif

#endif

    // UARTS

    memset(&PeriphClkInitStruct, 0, sizeof(PeriphClkInitStruct));
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART16910; // 1 6 9 10
    PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16910CLKSOURCE_D2PCLK2;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

    // clock setup from hal_msp
    memset(&PeriphClkInitStruct, 0, sizeof(PeriphClkInitStruct));
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART234578; // 2 3 4 5 7 8
    PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }


    /* Peripheral clock enable */
    #ifdef USE_USART1
    __HAL_RCC_USART1_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART1_IRQn);
    #endif
    #ifdef USE_USART2
    __HAL_RCC_USART2_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART2_IRQn);
    #endif
    #ifdef USE_USART3
    __HAL_RCC_USART3_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART3_IRQn);
    #endif
    #ifdef USE_USART4
    __HAL_RCC_USART4_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART4_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART4_IRQn);
    #endif
    #ifdef USE_USART5
    __HAL_RCC_USART5_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART5_IRQn);
    #endif
    #ifdef USE_USART6
    __HAL_RCC_USART6_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART6_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART6_IRQn);
    #endif
    #ifdef USE_USART7
    __HAL_RCC_USART7_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART7_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART7_IRQn);
    #endif
    #ifdef USE_USART8
    __HAL_RCC_USART8_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART8_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART8_IRQn);
    #endif
    #ifdef USE_USART9
    __HAL_RCC_USART9_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART9_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART9_IRQn);
    #endif
    #ifdef USE_USART10
    __HAL_RCC_USART10_CLK_ENABLE();
    HAL_NVIC_SetPriority(UART9_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(UART9_IRQn);
    #endif

    // ADC 
    memset(&PeriphClkInitStruct, 0, sizeof(PeriphClkInitStruct));
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_ADC;
    PeriphClkInitStruct.PLL2.PLL2M = 4;
    PeriphClkInitStruct.PLL2.PLL2N = 32;
    PeriphClkInitStruct.PLL2.PLL2P = 3;
    PeriphClkInitStruct.PLL2.PLL2Q = 2;
    PeriphClkInitStruct.PLL2.PLL2R = 2;
    PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL2VCIRANGE_2;
    PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOWIDE;
    PeriphClkInitStruct.PLL2.PLL2FRACN = 0;
    PeriphClkInitStruct.AdcClockSelection = RCC_ADCCLKSOURCE_PLL2;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

    /* Peripheral clock enable */
    __HAL_RCC_ADC12_CLK_ENABLE();

    // SPI
    memset(&PeriphClkInitStruct, 0, sizeof(PeriphClkInitStruct));
#ifdef USE_SPI_DEVICE_1
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_SPI1;
#endif
#ifdef USE_SPI_DEVICE_2
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_SPI2;
#endif
#ifdef USE_SPI_DEVICE_3
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_SPI3;
#endif

