iNavFlight/inav/src/main/target/stm32h7a3_impl.c
    PeriphClkInitStruct.Spi123ClockSelection = RCC_SPI123CLKSOURCE_CLKP;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

#if defined(USE_SPI_DEVICE_4) || defined(USE_SPI_DEVICE_5)
    memset(&PeriphClkInitStruct, 0, sizeof(PeriphClkInitStruct));

#ifdef USE_SPI_DEVICE_4
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_SPI4;
#endif
#ifdef USE_SPI_DEVICE_5
    PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_SPI5;
#endif
    PeriphClkInitStruct.Spi45ClockSelection = RCC_SPI45CLKSOURCE_D2PCLK1;
#endif

    /* Peripheral clock enable */
#ifdef USE_SPI_DEVICE_1
    __HAL_RCC_SPI1_CLK_ENABLE();
#endif
#ifdef USE_SPI_DEVICE_2
    __HAL_RCC_SPI2_CLK_ENABLE();
#endif
#ifdef USE_SPI_DEVICE_3
    __HAL_RCC_SPI3_CLK_ENABLE();
#endif
#ifdef USE_SPI_DEVICE_4
    __HAL_RCC_SPI4_CLK_ENABLE();
#endif
#ifdef USE_SPI_DEVICE_5
    __HAL_RCC_SPI5_CLK_ENABLE();
#endif

#ifdef USE_VCP
    // USB
    memset(&PeriphClkInitStruct, 0, sizeof(PeriphClkInitStruct));
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USB;
    PeriphClkInitStruct.UsbClockSelection = RCC_USBCLKSOURCE_HSI48;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

    /* Peripheral clock enable */
    __HAL_RCC_USB_OTG_HS_CLK_ENABLE();

    /* Peripheral interrupt init */
    HAL_NVIC_SetPriority(OTG_HS_EP1_OUT_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(OTG_HS_EP1_OUT_IRQn);
    HAL_NVIC_SetPriority(OTG_HS_EP1_IN_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(OTG_HS_EP1_IN_IRQn);
    HAL_NVIC_SetPriority(OTG_HS_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(OTG_HS_IRQn);
#endif



    // GPIO clocks
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();
    __HAL_RCC_GPIOI_CLK_ENABLE();

}
